jojo240607/joc-base/src/hal/stm32/clock_hal.c
#include "clock_hal.h"
#include "stm32f4xx.h"

#define CLOCK_HSE_HZ    8000000UL
#define CLOCK_SYSCLK_HZ 168000000UL

void clock_hal_configure(void)
{
    /* Enable HSE (8 MHz on the Discovery board) */
    RCC->CR |= RCC_CR_HSEON;
    while ((RCC->CR & RCC_CR_HSERDY) == 0) { }

    /* Flash latency: 5 WS @ 3.3 V, enable prefetch + I/D caches.
     * The linker script pads to 16-byte boundary (.flash_pad), so the
     * ART prefetch never reads a partial 128-bit row at the end of flash. */
    FLASH->ACR = FLASH_ACR_PRFTEN | FLASH_ACR_ICEN | FLASH_ACR_DCEN | FLASH_ACR_LATENCY_5WS;

    /* PLL: M=8 -> 1 MHz, N=336 -> 336 MHz, P=2 -> 168 MHz, Q=7 -> 48 MHz, SRC=HSE */
    RCC->PLLCFGR = (8U   << RCC_PLLCFGR_PLLM_Pos)
                 | (336U << RCC_PLLCFGR_PLLN_Pos)
                 | (0U   << RCC_PLLCFGR_PLLP_Pos)
                 | (7U   << RCC_PLLCFGR_PLLQ_Pos)
                 | RCC_PLLCFGR_PLLSRC_HSE;

    RCC->CR |= RCC_CR_PLLON;
    while ((RCC->CR & RCC_CR_PLLRDY) == 0) { }

    /* Bus prescalers: AHB /1, APB1 /4 (42 MHz), APB2 /2 (84 MHz) */
    RCC->CFGR |= RCC_CFGR_HPRE_DIV1 | RCC_CFGR_PPRE1_DIV4 | RCC_CFGR_PPRE2_DIV2;

    /* Select PLL as system clock. 先清 SW 位再置位：无论 SystemInit 已将 SYSCLK
     * 切到 HSI 还是 HSE，都能正确切到 PLL（避免 |= 在 HSE 基础上得到保留值 0x3）。 */
    RCC->CFGR = (RCC->CFGR & (uint32_t)~RCC_CFGR_SW) | RCC_CFGR_SW_PLL;
    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL) { }

    SystemCoreClock = CLOCK_SYSCLK_HZ;
}

uint32_t clock_hal_sysclk_hz(void)
{
    return CLOCK_SYSCLK_HZ;
}
